prog/TranslatingClient/src/META-INF/wsdl/localhost_8080/TranslatingService/TranslateServiceService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.translate.simple/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://service.translate.simple/" name="TranslateServiceService">
<wsp:Policy xmlns:wsat="http://schemas.xmlsoap.org/ws/2004/10/wsat" wsu:Id="TranslateServicePortBinding_translateASentence_WSAT_Policy">
<wsat:ATAlwaysCapability />
<wsat:ATAssertion xmlns:ns1="http://schemas.xmlsoap.org/ws/2002/12/policy" wsp:Optional="true" ns1:Optional="true" />
</wsp:Policy>
<types>
<xsd:schema>
<xsd:import namespace="http://service.translate.simple/" schemaLocation="http://localhost:8080/TranslatingService/TranslateServiceService?xsd=1" />
</xsd:schema>
</types>
<message name="translateASentence">
<part name="parameters" element="tns:translateASentence" />
</message>
<message name="translateASentenceResponse">
<part name="parameters" element="tns:translateASentenceResponse" />
</message>
<portType name="TranslateService">
<operation name="translateASentence">
<input wsam:Action="http://service.translate.simple/TranslateService/translateASentenceRequest" message="tns:translateASentence" />
<output wsam:Action="http://service.translate.simple/TranslateService/translateASentenceResponse" message="tns:translateASentenceResponse" />
</operation>
</portType>
<binding name="TranslateServicePortBinding" type="tns:TranslateService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="translateASentence">
<wsp:PolicyReference URI="#TranslateServicePortBinding_translateASentence_WSAT_Policy" />
<soap:operation soapAction="" />
<input>
<wsp:PolicyReference URI="#TranslateServicePortBinding_translateASentence_WSAT_Policy" />
<soap:body use="literal" />
</input>
<output>
<wsp:PolicyReference URI="#TranslateServicePortBinding_translateASentence_WSAT_Policy" />
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="TranslateServiceService">
<port name="TranslateServicePort" binding="tns:TranslateServicePortBinding">
<soap:address location="http://localhost:8080/TranslatingService/TranslateServiceService" />
</port>
</service>
</definitions>